БылковДА_70180166/src/Documents/ПротоколЗаседанияКомиссии/ПротоколЗаседанияКомиссии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПротоколЗаседанияКомиссии</name>
  <basedOn>Document.РекомендацииПоСтудентам</basedOn>
  <registerRecords>InformationRegister.ТекущийСтатусЗадолженностей</registerRecords>
  <registerRecords>AccumulationRegister.ДинамикаЛиквидацииЗадолженностей</registerRecords>
  <registerRecords>AccumulationRegister.УспешныеПересдачи</registerRecords>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВозникшихЗадолженностей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЛиквидированныхЗадолженностей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

БылковДА_70180166/src/Documents/ПротоколЗаседанияКомиссии/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ПротоколЗаседанияКомиссии.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПротоколЗаседанияКомиссии.Группа,
	|	ПротоколЗаседанияКомиссии.Дата,
	|	ПротоколЗаседанияКомиссии.КоличествоВозникшихЗадолженностей,
	|	ПротоколЗаседанияКомиссии.КоличествоЛиквидированныхЗадолженностей,
	|	ПротоколЗаседанияКомиссии.Номер,
	|	ПротоколЗаседанияКомиссии.Семестр,
	|	ПротоколЗаседанияКомиссии.Студент
	|ИЗ
	|	Документ.ПротоколЗаседанияКомиссии КАК ПротоколЗаседанияКомиссии
	|ГДЕ
	|	ПротоколЗаседанияКомиссии.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
